import React from "react";
import "./About.css";

function About({ closeOverlay }) {
    const handleClickOutside = (event) => {
        // Check if the clicked element is the overlay itself
        if (event.target.classList.contains("overlay")) {
            closeOverlay(); // Close the overlay
        }
    };

    return (
        <div className="overlay overlay-active" onClick={handleClickOutside}>
            <div className="overlay-content">
                <h2>תכנית הליווי - אורח חיים בריא</h2>

                <div className="program-section">
                    <h3>1. מטרות התהליך</h3>
                    <ul>
                        <li>פיתוח הרגלי תזונה בריאים נפשית ופיזית, תוך כדי התמקדות באוכל טבעי ומזין.</li>
                        <li>שיפור היכולות הפיזיות והגופניות בהתאם למטרות האישיות.</li>
                        <li>לימוד והבנה כיצד האוכל שאנחנו אוכלים משפיע עלינו ואיך ניתן להשתמש בו בצורה שמקדמת את הבריאות
                            שלנו.
                        </li>
                        <li>הקניית כלים פשוטים ויעילים לניהול תזונה יומיומית, מתוך הבנה שאין תפריט אחד שמתאים לכולם.
                        </li>
                    </ul>
                </div>

                <div className="program-section">
                    <h3>2. איך התהליך מתנהל?</h3>
                    <ul>
                        <li><b>פגישה ראשונה:</b> בשיחה כנה ואישית, נעמיק בהבנת ההרגלים שלך, מה מניע אותך ומה עשוי לעזור
                            לך להצליח בתהליך.
                        </li>
                        <li><b>בניית שגרה:</b> נבנה יחד תוכנית שתואמת את המטרות האישיות שלך, תוך כדי התחשבות במגבלות שיש
                            בשגרה שלך.
                        </li>
                        <li><b>מעקב ותמיכה:</b></li>
                        <ul>
                            <li>שיחת זום אחת לשבועיים - בכדי לאפשר התאמה ושיפור התכנית בהתאם להתקדמות שלך.</li>
                            <li>שאלונים שבועיים - מעקב שלי אחר ההתקדמות והתחושות שלך בתהליך.</li>
                            <li>זמינות בווצאפ - בין השעות 09:00 - 19:00 , בימי א׳ - ה׳.</li>
                        </ul>
                    </ul>
                </div>

                <div className="program-section">
                    <h3>3. משך ותדירות</h3>
                    <ul>
                        <li><b>משך התכנית:</b> בהתאם למטרות הלקוח - מינימום 3 חודשים, כדי לאפשר שינוי ארוך טווח.</li>
                        <li><b>תדירות:</b> שיחת זום אחת לשבועיים, מענה שבועי על שאלון ושיח יום - יומי בווצאפ.</li>
                    </ul>
                </div>

                <div className="program-section">
                    <h3>4. מה תקבל/י בתהליך?</h3>
                    <ul>
                        <li>מתכונים אישיים: מתכונים פשוטים המבוססים על רכיבים טבעיים וזמינים, מותאמים לאורח החיים שלך
                            ולמטרותיך.
                        </li>
                        <li>הדרכה וליווי: תלמד כיצד להרכיב צלחת מאוזנת, ללא סיבוכים וחישובים שוברי ראש.</li>
                        <li>תמיכה שוטפת: אני כאן איתך לאורך הדרך, עם שיחות מעמיקות, מעקב שבועי וזמינות יום יומית.</li>
                        <li>הבנה מעמיקה של הקשר בין אוכל לבריאות: לא רק "מה לאכול", אלא גם "למה לאכול" – תלמד איך האוכל
                            משפיע על מצב הרוח שלך, האנרגיה שלך, והבריאות הכללית שלך.
                        </li>
                        <li>התמודדות עם אתגרים יומיומיים: התמודדות עם אכילה בסיטואציות חברתיות, גמישות ושימור הרגלים
                            בחיי השגרה.
                        </li>
                        <li>שיפור היכולת הגופנית: בנייה של שגרת אימונים בריאה שתעבוד לאורך זמן.</li>
                    </ul>
                </div>

                <div className="program-section">
                    <h3>5. עלויות</h3>
                    <p>עלות התוכנית היא 649 ש״ח לחודש.</p>
                </div>

                <div className="program-section">
                    <h3>6. זה בידיים שלך</h3>
                    <p>
                        בסופו של דבר, הכול מתחיל ונגמר בהחלטה שלך. התהליך הזה נבנה כדי לתת לך את הכלים,
                        הידע והדחיפה שאת/ה צריכ/ה, אבל מי שבאמת מחולל את השינוי – זה את/ה.
                        אני כאן כדי לעזור לך לקחת את הצעד הראשון ולוודא שאת/ה לא עושה את זה לבד.
                        אז אם את/ה מוכן להתחיל, אני אשמח ללוות אותך.
                    </p>
                </div>
            </div>
        </div>
    );
}

export default About;
